In [2]:
import numpy as np
import pandas as pd

# Demo construcció Dataframe Pandas.
animals_df = pd.Series(data=['falcon', 'dog', 'snail', 'spider'], dtype="string")
df3 = pd.DataFrame(
    {
        "A": [1.0] + [np.nan] * 2 + [3.5],
        "B": pd.date_range("20220101", periods=4, freq='D'),
        "C": animals_df,
        "D": pd.Categorical(["Male", "Female", "NS/NC", "Female"]),
        "E": "foo",
    }
)

## Consulta de dades amb Pandas. Notes Alumnes.

In [3]:

#les notes de dawbio amb dataframe
student_list=["John","Mary","Lucy","Peter","Ann","Tom"]
grades_list = [7,9,8,4,10,6]
wants_dual_list = [False,True,False,True,True,True]
wants_dualipa_list = [True]
start_date = pd.date_range("20210101", periods=6)

datos: dict[list] = {"students": student_list, "grade": grades_list,
      "dual": wants_dual_list, "dualipa": wants_dualipa_list, 
      "start_date": start_date}

students_frame = pd.DataFrame(
    index=student_list,
    data=datos
)
students_frame

      students  grade   dual  dualipa start_date
John      John      7  False     True 2021-01-01
Mary      Mary      9   True     True 2021-01-02
Lucy      Lucy      8  False     True 2021-01-03
Peter    Peter      4   True     True 2021-01-04
Ann        Ann     10   True     True 2021-01-05
Tom        Tom      6   True     True 2021-01-06

In [4]:
#Comentari Aymane
#How to display  with display instead of print
# (creates formatting and better rending)

dict = {'Name' : ['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths' : [87, 91, 97, 95],
        'Science' : [83, 99, 84, 76]}
df = pd.DataFrame(dict)
  
# displaying the DataFrame
display(df)
# display is not callable, it has submodules

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [5]:
# Tipus 
students_frame.dtypes

students              object
grade                  int64
dual                    bool
dualipa                 bool
start_date    datetime64[ns]
dtype: object

In [6]:
# Files i columnes
df3.shape[1]
# df3.shape[1]

5

In [7]:
# Estadística.
#df3.describe()
df.describe()

           Maths    Science
count   4.000000   4.000000
mean   92.500000  85.500000
std     4.434712   9.678154
min    87.000000  76.000000
25%    90.000000  81.250000
50%    93.000000  83.500000
75%    95.500000  87.750000
max    97.000000  99.000000

In [8]:
# Head / tail.
df3.tail()

     A          B       C       D    E
0  1.0 2022-01-01  falcon    Male  foo
1  NaN 2022-01-02     dog  Female  foo
2  NaN 2022-01-03   snail   NS/NC  foo
3  3.5 2022-01-04  spider  Female  foo

In [9]:
students_frame.T

,John,Mary,Lucy,Peter,Ann,Tom
students,John,Mary,Lucy,Peter,Ann,Tom
grade,7,9,8,4,10,6
dual,False,True,False,True,True,True
dualipa,True,True,True,True,True,True
start_date,2021-01-01 00:00:00,2021-01-02 00:00:00,2021-01-03 00:00:00,2021-01-04 00:00:00,2021-01-05 00:00:00,2021-01-06 00:00:00

In [10]:
# Ordenar numèric
students_frame_sorted = students_frame.sort_values(by=["grade"],axis=0,ascending=True)
print(students_frame_sorted)

      students  grade   dual  dualipa start_date
Peter    Peter      4   True     True 2021-01-04
Tom        Tom      6   True     True 2021-01-06
John      John      7  False     True 2021-01-01
Lucy      Lucy      8  False     True 2021-01-03
Mary      Mary      9   True     True 2021-01-02
Ann        Ann     10   True     True 2021-01-05

In [11]:
# Utilitzar sempre localització d'un atribut
# .loc rep 2 parametres('enfonsar-se','bucejar')
print("Lucy grade = ",students_frame.loc["Lucy","grade"])

Lucy grade =  8

In [12]:
## All info from Lucy 
# students_frame.loc["Lucy"]

In [13]:
students_frame.loc["Lucy",["grade","dualipa"]]

grade         8
dualipa    True
Name: Lucy, dtype: object

In [64]:
#si vull totes les columnes de Lucy fico un slice buit a la columna
students_frame.loc["Lucy",:]
# crec que l'slice buit és opcional.

students                     Lucy
grade                           8
dual                        False
dualipa                      True
start_date    2021-01-03 00:00:00
Name: Lucy, dtype: object

In [14]:
#si vull totes les notes dels estudiants, a la fila poso un slice buit
students_frame.loc[:,"grade"]

John      7
Mary      9
Lucy      8
Peter     4
Ann      10
Tom       6
Name: grade, dtype: int64

In [15]:
#La primera coordenada capbusada | i despres bucejo -> però amb numèrics.
students_frame.iloc[0,1]

7

In [16]:
#Podem retornar una llista de varies files, i retorna una llista
students_frame2 = students_frame.loc[["Mary","Lucy"],
                   ["grade","dual"]]
print("llista varies files")
print(students_frame2)

llista varies files
      grade   dual
Mary      9   True
Lucy      8  False